Сайт/views/user/_form.php

SELECT * FROM `Gender`
---

            <?= $form->field($model, 'FIO')->textInput(['maxlength' => true]) ?>

            <?= $form->field($model, 'ID_Gender')->dropdownList($items=ArrayHelper::map(Gender::find()->all(), 'ID','Name'), ['prompt'=>'Выберите пол']) ?>