Сайт/models/User.php

    public static function findByUsername($username)
    {
        return User::findOne(['Username' => $username]);
---
SELECT * FROM `User` WHERE `Username`='Rin'