Сайт/views/active/_form.php

SELECT * FROM `Films`
---
            ];
            ?>

            <?= $form->field($model, 'ID_film')->dropdownList($items=ArrayHelper::map(Films::find()->all(), 'ID','Name'), ['prompt'=>'Выберите фильм или сериал']) ?>