Сайт/controllers/AdminController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => User::find(),
            /*
            'pagination' => [
                'pageSize' => 50
            ],
            'sort' => [
                'defaultOrder' => [
                    'ID' => SORT_DESC,
                ]
            ],
            */
        ]);

        $genderStats = User::find()
            ->select(['ID_Gender', 'COUNT(*) as count'])
            ->groupBy('ID_Gender')
            ->asArray()
            ->all();
---
SELECT `ID_Gender`, COUNT(*) AS `count` FROM `User` GROUP BY `ID_Gender`

        ];

        // Получаем всех пользователей
        $users = User::find()->all();
---
SELECT * FROM `User`

        $ageValues = array_values($ageGroups);

        // Получаем все фильмы из базы данных
        $films = Films::find()->all();
---
SELECT * FROM `Films`

            $yearValuesSorted[] = $yearCounts[$year];
        }

        $totalUsers = User::find()->count();
        $totalFilms = Films::find()->count();
---
SELECT COUNT(*) FROM `User`
SELECT COUNT(*) FROM `Films`

    public function actionSearch()
    {
        $model = new \yii\base\DynamicModel(['search']);
        $model->addRule(['search'], 'string');

        $results = [];

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $searchTerm = $model->search;

            // Создаем запрос
            $query = new Query();
            $results = $query->select('User.*, Gender.Name AS gender_Name, Role.Name AS role_Name')
                ->from('User')
                ->leftJoin('Gender', 'User.ID_Gender = Gender.ID')
                ->leftJoin('Role', 'User.ID_role = Role.ID')
                ->where(['like', 'Username', $searchTerm])
                ->all();
---
SELECT `User`.*, `Gender`.`Name` AS `gender_Name`, `Role`.`Name` AS `role_Name` FROM `User` LEFT JOIN `Gender` ON User.ID_Gender = Gender.ID LEFT JOIN `Role` ON User.ID_role = Role.ID WHERE `Username` LIKE '%Rin%'