Сайт/controllers/FilmsController.php

SELECT * FROM `Films` WHERE `ID`='6'
---
    protected function findModel($ID)
    {
        if (($model = Films::findOne(['ID' => $ID])) !== null) {