Сайт/controllers/SiteController.php

    public function actionCatalog()
    {
        // Создаем динамическую модель с атрибутами для фильтрации
        $model = new \yii\base\DynamicModel(['Country', 'Genre', 'Release_Year']);
        $model->addRule(['Country', 'Genre', 'Release_Year'], 'string');

        $countriesRaw = Films::find()
            ->select('Country')
            ->column(); // Получаем массив значений

        // Объединение значений, разделенных запятыми, и удаление дубликатов
        $countries = [];
        foreach ($countriesRaw as $countryString) {
            $countryList = explode(',', $countryString); // Разделяем по запятой
            foreach ($countryList as $country) {
                $countries[trim($country)] = trim($country); // Убираем пробелы и добавляем в массив
            }
        }

        $genresRaw = Films::find()
        ->select('Genre')
        ->column(); // Получаем массив значений
---
SELECT `Country` FROM `Films`
SELECT `Genre` FROM `Films`

        }

        // $years содержит значения в формате 'YYYY-MM-DD'
        $yearsRaw = Films::find()
        ->select('Release_Year')
        ->orderBy(['Release_Year' => SORT_DESC])
        ->column(); // Получаем массив значений
---
SELECT `Release_Year` FROM `Films` ORDER BY `Release_Year` DESC

    public function actionSearch()
    {
        $model = new \yii\base\DynamicModel(['search']);
        $model->addRule(['search'], 'string');

        $results = [];

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $searchTerm = $model->search;

            // Создаем запрос
            $query = new Query();
            $results = $query->select('*')
                ->from('Films')
                ->where(['like', 'Name', $searchTerm])
                ->all();
---
SELECT * FROM `Films` WHERE `Name` LIKE '%Аватар%'